{
  "additionalExperience": {
    "title": "Spare Time Experience",
    "text":
      "In my spare time, I like to learn about new technologies and frameworks, that's why probably you won't see them listed as part of my work Experience, if you are interested in knowing my experience on those, you can visit My Projects section and click on each of them to learn more about what I like to do and learn in my free time."
  },
  "experience": [
    {
      "company": "Oracle",
      "period": "09/2016 – Current",
      "city": "Guadalajara, México",
      "website": "http://oracle.com",
      "jobTitle": "Senior Front-End Engineer",
      "description":
        "Developing and giving support to some of the Data Visualization Web App features (rendering and logic with Object Oriented JavaScript).",
      "descThumbs": [
        "Communicating different components with events using the Pub/Sub pattern with Object Oriented JavaScript.",
        "Leading and doing Code Reviews to a couple of new members, guiding them on the development process.",
        "Developing Functional Tests with Selenium Framework in Java.",
        "Implementing Undo/Redo functionality using Memento Design Pattern with Object Oriented JavaScript.",
        "Consuming REST APIs from the client side and giving support to them using Java.",
        "Styling the components and Web Application using Sass."
      ],
      "anchors": [
        {
          "title": "Go to Oracle's Data Visualization site",
          "href":
            "https://www.oracle.com/solutions/business-analytics/data-visualization.html",
          "content": "Data Visualization"
        }
      ]
    },
    {
      "company": "Oracle",
      "period": "10/2014 – 09/2016",
      "city": "Guadalajara, México",
      "website": "http://oracle.com",
      "jobTitle": "Front-End Engineer",
      "description":
        "Developed and designed the Plugins Gallery Website for Oracle BIMAD. Created plugin graphs using D3.",
      "descThumbs": [
        "Created Waterfall chart plugin with D3, Grunt as Package Manager and Less as CSS preprocessor.",
        "Developed the Plugins Gallery Website with AngularJS requesting the plugins' data from GitHub.com.",
        "Integrated filters to Oracle Data Visualization Mobile Web App using Object Oriented JavaScript."
      ],
      "anchors": [
        {
          "title": "See repository on GitHub",
          "href": "https://github.com/oraclebimad/gallery/tree/gh-pages",
          "content": "Plugins Gallery Web Site"
        },
        {
          "title": "Go to BIMAD site",
          "href":
            "http://www.oracle.com/technetwork/middleware/bi-foundation/bi-mobile-app-designer-1983915.html",
          "content": "BIMAD"
        },
        {
          "title": "Go to DV Mobile",
          "href":
            "https://docs.oracle.com/en/cloud/paas/data-visualization-cloud/bidvc/exploring-data-mobile-devices.html",
          "content": "Web Mobile Application"
        }
      ]
    },
    {
      "company": "Esurance: HCL Technologies",
      "period": "06/2014 – 10/2014",
      "city": "Guadalajara, México",
      "website": "http://esurance.com",
      "jobTitle": "Mobile Web Developer",
      "description":
        "Developed the Mobile Web App (using ASP.NET and JavaScript).",
      "descThumbs": [
        "Gave support to renew policies for cars and motorcycles section using JavaScript for the Front-End and ASP.NET for the backend.",
        "Created an internal tool to track the Team work progress with the MEAN stack."
      ]
    },
    {
      "company": "Univision: HCL Technologies",
      "period": "05/2013 – 06/2014",
      "city": "Guadalajara, México",
      "website": "http://univision.com",
      "jobTitle": "Front-End Developer",
      "description":
        "Gave ideas for the creation of the responsive design for Univision’s News site.",
      "descThumbs": [
        "Decision making in Miami Univision’s offices related to responsive design and widget creation for Univision’s core site.",
        "Developed Score Table for the World Cup 2014 Univision's site using AngularJS.",
        "Created responsive widgets with Thymeleaf as template engine.",
        "Implemented RequireJS to dynamically load all Website’s JavaScript files."
      ]
    },
    {
      "company": "4th Source",
      "period": "01/2013 - 05/2013",
      "website": "http://4thsource.com",
      "city": "Mérida, México",
      "jobTitle": "Software Developer",
      "description":
        "Developed a Website for a landscaping company and an internal Web Application for HR department.",
      "descThumbs": [
        "Met with clients to get their requirements and translate them into tasks.",
        "Developed the Website under the ASP.NET Framework 4.5, using Entity Framework, jQuery and Bootstrap.",
        "Gave ideas to create the internal tool for HR.",
        "Developed the internal tool under the Ruby on Rails Framework, JavaScript and jQuery."
      ]
    },
    {
      "company": "CodeDS",
      "period": "07/2010 - 09/2011",
      "website": "",
      "city": "Chihuahua, México",
      "jobTitle": "Co-Founder, Developer",
      "description":
        "Developed desktop applications (using WPF and SQL Server Databases) and websites (using ASP.NET 3.5 with MySQL Databases).",
      "descThumbs": [
        "Advised and consulted on website design of clients’ websites.",
        "Helped and advised colleagues on all aspects of website application projects.",
        "Developed client’s websites using HTML5, CSS3, JavaScript and jQuery.",
        "Developed and managed systems using SQL Server 2008, Visual Studio 2008, WPF and Crystal Reports."
      ]
    }
  ]
}
