{
  "profilePic": {
    "url": "./profile-pic.jpg",
    "alt": "Ad치n Carrasco Profile Pic"
  },
  "profilePicHover": {
    "url": "./profile-pic-2.jpg",
    "alt": "Ad치n Carrasco Profile Pic"
  },
  "personalData": {
    "name": {
      "title": "Name:",
      "value": "Ad치n Carrasco"
    },
    "dateOfBirth": {
      "title": "Date of birth:",
      "value": "August 26, 1989"
    },
    "nationality": {
      "title": "Nationality:",
      "value": "Mexican"
    },
    "workingAt": {
      "title": "Senior Front-End Engineer at ",
      "value": "Oracle"
    }
  },
  "email": {
    "title": "Email:",
    "email": "hello@adancarrasco.com",
    "anchorTitle": "Send me an email.",
    "value": "email me"
  },
  "aboutMe": {
    "title": "About",
    "descImageSide": [
      "Hi, I'm Ad치n Carrasco.",
      "I am a Senior Front-End Engineer currently working at Oracle. Specializing in Web and Hybrid Mobile Apps Development. Loving and manipulating JavaScript from Vanilla to High-End Libraries and Frameworks as React and Angular. Fluent in Back-End Languages and Frameworks as NodeJS, Java, Ruby on Rails, C#, ASP.NET.",
      "I started loving computers when I was 12 years old, back then my Operative System was broken due to a Trojan virus that removed important startup files and I restored it by using only MS-DOS commands and copied the missing files from the installation CD into the Hard Drive. Since that moment I felt how powerful computers are, also I realized that by creating Software I could help others to make their lives easier, by doing the Software they need to accomplish their work, improving their lifes and connecting with others."
    ],
    "descBelowImage": [
      "That's why I love creating Software, I can tell the computers and now smartphones and tablets through poems only they understand (code) how to help people and how to automate their tasks and duties, that's the best part of my career as a Software Engineer.",
      "Do you like this template? You can fork it in GitHub and customize it with your own colors and information."
    ]
  }
}
